## Staging: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # aws_route53_record.form_viewer[0] must be replaced
  # (moved from aws_route53_record.form_viewer)
-/+ resource "aws_route53_record" "form_viewer" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "forms-staging.cdssandbox.xyz" -> (known after apply)
      ~ id              = "Z05990652HOQ0SGHD81ZC_forms-staging.cdssandbox.xyz_A" -> (known after apply)
        name            = "forms-staging.cdssandbox.xyz"
      - records         = [] -> null
      - ttl             = 0 -> null
      ~ zone_id         = "Z05990652HOQ0SGHD81ZC" -> "mocked_zone_id_[\"forms-staging.cdssandbox.xyz\",\"forms-formulaires.canada.ca\"]" # forces replacement
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_shield_protection.route53_hosted_zone[0] must be replaced
  # (moved from aws_shield_protection.route53_hosted_zone)
-/+ resource "aws_shield_protection" "route53_hosted_zone" {
      ~ arn          = "arn:aws:shield::687401027353:protection/84aef9e9-74ea-4dfc-bc40-ff3f3ca3700c" -> (known after apply)
      ~ id           = "84aef9e9-74ea-4dfc-bc40-ff3f3ca3700c" -> (known after apply)
        name         = "Route53HostedZone"
      ~ resource_arn = "arn:aws:route53:::hostedzone/Z05990652HOQ0SGHD81ZC" -> "arn:aws:route53:::hostedzone/mocked_zone_id_[\"forms-staging.cdssandbox.xyz\",\"forms-formulaires.canada.ca\"]" # forces replacement
        tags         = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (1 unchanged attribute hidden)
    }

  # aws_wafv2_regex_pattern_set.forms_base_url will be updated in-place
  ~ resource "aws_wafv2_regex_pattern_set" "forms_base_url" {
        id          = "92da9411-8b49-4c9e-b80f-ac7ea482f3d1"
        name        = "forms_base_url"
        tags        = {}
        # (5 unchanged attributes hidden)

      - regular_expression {
          - regex_string = "forms-staging.cdssandbox.xyz$" -> null
        }
      + regular_expression {
          + regex_string = "^forms-formulaires.canada.ca$"
        }
      + regular_expression {
          + regex_string = "^forms-staging.cdssandbox.xyz$"
        }
    }

Plan: 2 to add, 1 to change, 2 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.firehose_waf_logs,
  on kinesis.tf line 30, in resource "aws_s3_bucket" "firehose_waf_logs":
  30: resource "aws_s3_bucket" "firehose_waf_logs" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 5 more similar warnings elsewhere)
Releasing state lock. This may take a few moments...

Error: Not enough function arguments

  on certificates.tf line 8, in resource "aws_acm_certificate" "form_viewer":
   8:   subject_alternative_names = length(var.domain) > 1 ? slice(var.domain, 1) : []
    ├────────────────
    │ while calling slice(list, start_index, end_index)
    │ var.domain is list of string with 2 elements

Function "slice" expects 3 argument(s). Missing value for "end_index".

Error: Invalid index

  on route53.tf line 6, in resource "aws_route53_record" "form_viewer":
   6:   zone_id = var.hosted_zone_ids[count.index]
    ├────────────────
    │ count.index is 1
    │ var.hosted_zone_ids is list of string with 1 element

The given key does not identify an element in this collection value: the
given index is greater than or equal to the length of the collection.
time=2023-10-23T15:55:35Z level=error msg=Terraform invocation failed in /home/runner/work/forms-terraform/forms-terraform/env/cloud/load_balancer/.terragrunt-cache/8CJu3E6tls1VOlHT6vQAFFRgrcQ/-syjFrdAaB-6kNXhMmF1nXBOp7o/load_balancer prefix=[/home/runner/work/forms-terraform/forms-terraform/env/cloud/load_balancer] 
time=2023-10-23T15:55:35Z level=error msg=1 error occurred:
	* [/home/runner/work/forms-terraform/forms-terraform/env/cloud/load_balancer/.terragrunt-cache/8CJu3E6tls1VOlHT6vQAFFRgrcQ/-syjFrdAaB-6kNXhMmF1nXBOp7o/load_balancer] exit status 1



```

</details>

